<a href="https://colab.research.google.com/github/RCTom168/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/RT_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-12-04 23:38:19--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.8.22
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.8.22|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  56.1MB/s    in 3.5s

2019-12-04 23:38:22 (56.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [0]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [0]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [0]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
# We need the columns for Product ID, Product Name & re_ordered
# We do not need the information in aisles.csv, departments.csv, 
# or orders.csv
# The 2 data frames that we need are order_products__prior.csv & 
# order_products__train.csv because they have the product_id & we can count the 
# amount of times a specific product_id comes up
# (and because we want to know the non-test data) &
# products.csv because it has both the product_id & the Product Name

In [0]:
##### YOUR CODE HERE #####
import pandas as pd

In [0]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

In [0]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

In [0]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

In [0]:
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

In [0]:
#This will drop the unncecessary columns from products
products = products.drop(['aisle_id', 'department_id'], axis = 1)
products.head(20)

In [0]:
#This will drop the unncecessary columns from order_products__prior
order_products__prior = order_products__prior.drop(['order_id', 'add_to_cart_order'], axis = 1)
order_products__prior.head()

In [0]:
#This will drop the unncecessary columns from order_products__train
order_products__train = order_products__train.drop(['order_id', 'add_to_cart_order'], axis = 1)
order_products__train.head()

In [0]:
#This will combine the order_products__train and order_products_prior data frames
order_products = pd.concat([order_products__train, order_products__prior])
order_products.shape
order_products.head()

   product_id  reordered
0       49302          1
1       11109          1
2       10246          0
3       49683          0
4       43633          1

In [0]:
#This tells us what the most frequently occurring product IDs are in the order_products data frame
most_frequent_product_ids = order_products["product_id"].value_counts()
most_frequent_product_ids = most_frequent_product_ids.head(10) 
most_frequent_product_ids

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

In [0]:
# Here we are trying to slim down the products data frame to only include the
# Top 10 Produce Names by referncing the Top 10 Product IDs 
products_subset = products[(products['product_id'] == 24852) | 
                           (products['product_id'] == 13176) | 
                           (products['product_id'] == 21137) | 
                           (products['product_id'] == 21903) |
                           (products['product_id'] == 47209) |
                           (products['product_id'] == 47766) |
                           (products['product_id'] == 47626) |
                           (products['product_id'] == 16797) |
                           (products['product_id'] == 26209) | 
                           (products['product_id'] == 27845)]
print(products_subset.shape)
products_subset.head(10)

(10, 2)

       product_id            product_name
13175       13176  Bag of Organic Bananas
16796       16797            Strawberries
21136       21137    Organic Strawberries
21902       21903    Organic Baby Spinach
24851       24852                  Banana
26208       26209                   Limes
27844       27845      Organic Whole Milk
47208       47209    Organic Hass Avocado
47625       47626             Large Lemon
47765       47766         Organic Avocado

In [0]:
top_10_products = pd.merge(order_products, products_subset, on = 'product_id', how = 'inner')

top_10_products

         product_id  reordered            product_name
0             13176          0  Bag of Organic Bananas
1             13176          1  Bag of Organic Bananas
2             13176          1  Bag of Organic Bananas
3             13176          1  Bag of Organic Bananas
4             13176          1  Bag of Organic Bananas
...             ...        ...                     ...
2418309       47766          1         Organic Avocado
2418310       47766          1         Organic Avocado
2418311       47766          0         Organic Avocado
2418312       47766          1         Organic Avocado
2418313       47766          1         Organic Avocado

[2418314 rows x 3 columns]

In [0]:
top_10_products['product_name'].value_counts()[:10]

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [0]:
top_10_products = top_10_products.sort_values(by=['product_name'])
top_10_products

         product_id  reordered            product_name
0             13176          0  Bag of Organic Bananas
263292        13176          1  Bag of Organic Bananas
263291        13176          1  Bag of Organic Bananas
263290        13176          1  Bag of Organic Bananas
263289        13176          0  Bag of Organic Bananas
...             ...        ...                     ...
1432492       16797          1            Strawberries
1432493       16797          1            Strawberries
1432494       16797          1            Strawberries
1432514       16797          1            Strawberries
1385993       16797          1            Strawberries

[2418314 rows x 3 columns]

In [0]:
top_10_products = top_10_products[['Banana', 'Bag of Organic Bananas',
                                    'Organic Strawberries', 'Organic Baby Spinach',
                                    'Organic Hass Avocado', 'Organic Avocado',
                                    'Large Lemon', 'Strawberries', 'Limes', 'Organic Whole Milk']]
top_10_products

In [0]:
most_frequent_product_ids = top_10_products["product_id"].value_counts()
most_frequent_product_ids = most_frequent_product_ids.head(10)

24852    491291
13176    394930
21137    275577
21903    251705
47209    220877
47766    184224
47626    160792
16797    149445
26209    146660
27845    142813
Name: product_id, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Why do we care aout Tidy Data and Tidy Format?
# Tidy datasets are easy to manipulate, model and visualize, and have a specific
# structure: each variable is a column, each observation is a row, and each type
# of observational unit is a table. 
# This framework makes it easy to tidy messy datasets because only a small set 
# of tools are needed to deal with a wide range of un-tidy datasets. 
# This structure also makes it easier to develop tidy tools for data analysis, 
# tools that both input and output tidy datasets. The advantages of a consistent
# data structure and matching tools are demonstrated with a case study free from
# mundane data manipulation chores.

%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

#This method of data entry is specifying values for each row
table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

In [0]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [0]:
# First we take the row index and add it to table1 as a new column
# Now the 3 names can be more easily accessed through their column header
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [0]:
# We are looking to see what the unique idenfitier is for each row
# We want to go from the Wide Format to the Tidy Format
# In this case, "id_vars" indicates the unique identifier by row
# "value_vars" indicates the parameters
tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy1

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [0]:
# rename columns to better match the variables in them
tidy1 = tidy1.rename(columns={
    'index': 'name', 
    'variable': 'trt', #Treatment
    'value': 'result'
})
tidy1

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [0]:
# This will replace the word treatment with a blank space, leaving
# only the Treatment letter a or b
# Now we have table1 in Tidy Format
tidy1.trt = tidy1.trt.str.replace('treatment', '')

tidy1

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [0]:
# Now let's change tidy1 back into table2
wide = tidy1.pivot_table(index = 'name', columns = 'trt', values = 'result')

wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

In [0]:
#Table 2 is a transpose of Table 1, the rows and columns are swapped
# The Names are used as inique identifiers instead of integers
table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [0]:
# table2 -> tidy
# The value_vars become the names
tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [0]:
tidy2 = tidy2.rename (columns = {
    'index': 'trt',
    'variable': 'name',
    'value': 'result'
})

tidy2

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [0]:
tidy2.trt = tidy2.trt.str.replace('treatment', '')

tidy2

  trt          name  result
0   a    John Smith     NaN
1   b    John Smith     2.0
2   a      Jane Doe    16.0
3   b      Jane Doe    11.0
4   a  Mary Johnson     3.0
5   b  Mary Johnson     1.0

In [0]:
# tidy -> table2
# The Wide Format makes it easier to read the information
wide = tidy2.pivot_table(index = 'trt', columns = 'name', values = 'result')

wide

name  Jane Doe  John Smith  Mary Johnson
trt
a         16.0         NaN           3.0
b         11.0         2.0           1.0

In [0]:
# Now we can work on the seaborn flights dataset
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [0]:
#This loads seaborn's flights dataset
flights = sns.load_dataset('flights')

In [0]:
flights.head(144)

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [0]:
# We want the unique value in each row to be the year, so we will
# use the year column as the index
# We will use month for the columns
# We will use flights as the data for the Pivot Table
# We will use the passengers as teh values for the different cells

In [0]:
# Flights Pivot Table

In [0]:

pd.pivot_table(data = flights, index='year', 
               columns = 'month', values='passengers')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####